micropython/micropython/ports/teensy/core/mk20dx128.h
// Chapter 47: General-Purpose Input/Output (GPIO)
#define GPIOA_PDOR		*(volatile uint32_t *)0x400FF000 // Port Data Output Register
#define GPIOA_PSOR		*(volatile uint32_t *)0x400FF004 // Port Set Output Register
#define GPIOA_PCOR		*(volatile uint32_t *)0x400FF008 // Port Clear Output Register
#define GPIOA_PTOR		*(volatile uint32_t *)0x400FF00C // Port Toggle Output Register
#define GPIOA_PDIR		*(volatile uint32_t *)0x400FF010 // Port Data Input Register
#define GPIOA_PDDR		*(volatile uint32_t *)0x400FF014 // Port Data Direction Register
#define GPIOB_PDOR		*(volatile uint32_t *)0x400FF040 // Port Data Output Register
#define GPIOB_PSOR		*(volatile uint32_t *)0x400FF044 // Port Set Output Register
#define GPIOB_PCOR		*(volatile uint32_t *)0x400FF048 // Port Clear Output Register
#define GPIOB_PTOR		*(volatile uint32_t *)0x400FF04C // Port Toggle Output Register
#define GPIOB_PDIR		*(volatile uint32_t *)0x400FF050 // Port Data Input Register
#define GPIOB_PDDR		*(volatile uint32_t *)0x400FF054 // Port Data Direction Register
#define GPIOC_PDOR		*(volatile uint32_t *)0x400FF080 // Port Data Output Register
#define GPIOC_PSOR		*(volatile uint32_t *)0x400FF084 // Port Set Output Register
#define GPIOC_PCOR		*(volatile uint32_t *)0x400FF088 // Port Clear Output Register
#define GPIOC_PTOR		*(volatile uint32_t *)0x400FF08C // Port Toggle Output Register
#define GPIOC_PDIR		*(volatile uint32_t *)0x400FF090 // Port Data Input Register
#define GPIOC_PDDR		*(volatile uint32_t *)0x400FF094 // Port Data Direction Register
#define GPIOD_PDOR		*(volatile uint32_t *)0x400FF0C0 // Port Data Output Register
#define GPIOD_PSOR		*(volatile uint32_t *)0x400FF0C4 // Port Set Output Register
#define GPIOD_PCOR		*(volatile uint32_t *)0x400FF0C8 // Port Clear Output Register
#define GPIOD_PTOR		*(volatile uint32_t *)0x400FF0CC // Port Toggle Output Register
#define GPIOD_PDIR		*(volatile uint32_t *)0x400FF0D0 // Port Data Input Register
#define GPIOD_PDDR		*(volatile uint32_t *)0x400FF0D4 // Port Data Direction Register
#define GPIOE_PDOR		*(volatile uint32_t *)0x400FF100 // Port Data Output Register
#define GPIOE_PSOR		*(volatile uint32_t *)0x400FF104 // Port Set Output Register
#define GPIOE_PCOR		*(volatile uint32_t *)0x400FF108 // Port Clear Output Register
#define GPIOE_PTOR		*(volatile uint32_t *)0x400FF10C // Port Toggle Output Register
#define GPIOE_PDIR		*(volatile uint32_t *)0x400FF110 // Port Data Input Register
#define GPIOE_PDDR		*(volatile uint32_t *)0x400FF114 // Port Data Direction Register

// Chapter 48: Touch sense input (TSI)
#define TSI0_GENCS		*(volatile uint32_t *)0x40045000 // General Control and Status Register
#define TSI_GENCS_LPCLKS		(uint32_t)0x10000000		//
#define TSI_GENCS_LPSCNITV(n)		(((n) & 15) << 24)		//
#define TSI_GENCS_NSCN(n)		(((n) & 31) << 19)		//
#define TSI_GENCS_PS(n)			(((n) & 7) << 16)		//
#define TSI_GENCS_EOSF			(uint32_t)0x00008000		//
#define TSI_GENCS_OUTRGF		(uint32_t)0x00004000		//
#define TSI_GENCS_EXTERF		(uint32_t)0x00002000		//
#define TSI_GENCS_OVRF			(uint32_t)0x00001000		//
#define TSI_GENCS_SCNIP			(uint32_t)0x00000200		//
#define TSI_GENCS_SWTS			(uint32_t)0x00000100		//
#define TSI_GENCS_TSIEN			(uint32_t)0x00000080		//
#define TSI_GENCS_TSIIE			(uint32_t)0x00000040		//
#define TSI_GENCS_ERIE			(uint32_t)0x00000020		//
#define TSI_GENCS_ESOR			(uint32_t)0x00000010		//
#define TSI_GENCS_STM			(uint32_t)0x00000002		//
#define TSI_GENCS_STPE			(uint32_t)0x00000001		//
#define TSI0_SCANC		*(volatile uint32_t *)0x40045004 // SCAN Control Register
#define TSI_SCANC_REFCHRG(n)		(((n) & 15) << 24)		//
#define TSI_SCANC_EXTCHRG(n)		(((n) & 7) << 16)		//
#define TSI_SCANC_SMOD(n)		(((n) & 255) << 8)		//
#define TSI_SCANC_AMCLKS(n)		(((n) & 3) << 3)		//
#define TSI_SCANC_AMPSC(n)		(((n) & 7) << 0)		//
#define TSI0_PEN		*(volatile uint32_t *)0x40045008 // Pin Enable Register
#define TSI0_WUCNTR		*(volatile uint32_t *)0x4004500C // Wake-Up Channel Counter Register
#define TSI0_CNTR1		*(volatile uint32_t *)0x40045100 // Counter Register
#define TSI0_CNTR3		*(volatile uint32_t *)0x40045104 // Counter Register
#define TSI0_CNTR5		*(volatile uint32_t *)0x40045108 // Counter Register
#define TSI0_CNTR7		*(volatile uint32_t *)0x4004510C // Counter Register
#define TSI0_CNTR9		*(volatile uint32_t *)0x40045110 // Counter Register
#define TSI0_CNTR11		*(volatile uint32_t *)0x40045114 // Counter Register
#define TSI0_CNTR13		*(volatile uint32_t *)0x40045118 // Counter Register
#define TSI0_CNTR15		*(volatile uint32_t *)0x4004511C // Counter Register
#define TSI0_THRESHOLD		*(volatile uint32_t *)0x40045120 // Low Power Channel Threshold Register

// Nested Vectored Interrupt Controller, Table 3-4 & ARMv7 ref, appendix B3.4 (page 750)
#define NVIC_ENABLE_IRQ(n)	(*((volatile uint32_t *)0xE000E100 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_DISABLE_IRQ(n)	(*((volatile uint32_t *)0xE000E180 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_SET_PENDING(n)	(*((volatile uint32_t *)0xE000E200 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_CLEAR_PENDING(n)	(*((volatile uint32_t *)0xE000E280 + (n >> 5)) = (1 << (n & 31)))

#define NVIC_ISER0		*(volatile uint32_t *)0xE000E100
#define NVIC_ISER1		*(volatile uint32_t *)0xE000E104
#define NVIC_ICER0		*(volatile uint32_t *)0xE000E180
#define NVIC_ICER1		*(volatile uint32_t *)0xE000E184

// 0 = highest priority
// Cortex-M4: 0,16,32,48,64,80,96,112,128,144,160,176,192,208,224,240
// Cortex-M0: 0,64,128,192
#define NVIC_SET_PRIORITY(irqnum, priority)  (*((volatile uint8_t *)0xE000E400 + (irqnum)) = (uint8_t)(priority))
#define NVIC_GET_PRIORITY(irqnum) (*((uint8_t *)0xE000E400 + (irqnum)))

#if defined(__MK20DX128__)
#define IRQ_DMA_CH0		0
#define IRQ_DMA_CH1		1
#define IRQ_DMA_CH2		2
#define IRQ_DMA_CH3		3
#define IRQ_DMA_ERROR		4
#define IRQ_FTFL_COMPLETE	6
#define IRQ_FTFL_COLLISION	7
#define IRQ_LOW_VOLTAGE		8
#define IRQ_LLWU		9
#define IRQ_WDOG		10
#define IRQ_I2C0		11
#define IRQ_SPI0		12
#define IRQ_I2S0_TX		13
#define IRQ_I2S0_RX		14
#define IRQ_UART0_LON		15
#define IRQ_UART0_STATUS	16
#define IRQ_UART0_ERROR		17
#define IRQ_UART1_STATUS	18
#define IRQ_UART1_ERROR		19
#define IRQ_UART2_STATUS	20
#define IRQ_UART2_ERROR		21
#define IRQ_ADC0		22
#define IRQ_CMP0		23
#define IRQ_CMP1		24
#define IRQ_FTM0		25
#define IRQ_FTM1		26
#define IRQ_CMT			27
#define IRQ_RTC_ALARM		28
#define IRQ_RTC_SECOND		29
#define IRQ_PIT_CH0		30
#define IRQ_PIT_CH1		31
#define IRQ_PIT_CH2		32
#define IRQ_PIT_CH3		33
#define IRQ_PDB			34
#define IRQ_USBOTG		35
#define IRQ_USBDCD		36
#define IRQ_TSI			37
#define IRQ_MCG			38
#define IRQ_LPTMR		39
#define IRQ_PORTA		40
#define IRQ_PORTB		41
#define IRQ_PORTC		42
#define IRQ_PORTD		43
#define IRQ_PORTE		44
#define IRQ_SOFTWARE		45
#define NVIC_NUM_INTERRUPTS	46

